GameReview/app/views/games/show.html.erb

			<div class="average-review-rating" data-score="<%= @average_review %>"></div>
			<span class ="number-of-reviews">Based on <%= @game.reviews.count %> reviews</span> <br />
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 7]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 7]]