RestaurantReview/app/views/restaurants/show.html.erb

			<div class="average-review-rating" data-score=<%= @average_review %>></div>
			<p class = "number-of-reviews">Based on <%= @restaurant.reviews.count %> review(s)</p>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 13]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 13]]