RestaurantReview/app/controllers/restaurants_controller.rb

	def index
		if params[:category].blank?
			@restaurants = Restaurant.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@restaurants = Restaurant.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "restaurants".* FROM "restaurants" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fast food"], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]

	def show
		if @restaurant.reviews.blank?
			@average_review = 0
		else
			@average_review = @restaurant.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 9]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 13]]

	def new
		@restaurant = current_user.restaurants.build
		@categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def create
		@restaurant = current_user.restaurants.build(restaurant_params)
		@restaurant.category_id = params[:category_id]


		if @restaurant.save
			redirect_to root_path
		else
			#@restaurant = current_user.restaurants.build
			@categories = Category.all.map{ |c| [c.name, c.id] }
---
INSERT INTO "restaurants" ("title", "description", "location", "created_at", "updated_at", "user_id", "category_id", "restaurant_img_file_name", "restaurant_img_content_type", "restaurant_img_file_size", "restaurant_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "categories".* FROM "categories"

	def update
		@restaurant.category_id = params[:category_id]
		if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "description" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["description", "An international food chain that specializes in affordable burgers, fries, and other typical American dishes.!!!!!!"], ["updated_at", "2018-09-16 20:37:50.457235"], ["id", 1]]

		def find_restaurant
			@restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]