RestaurantReview/app/controllers/reviews_controller.rb

	def create
		@review = Review.new(review_params)
		@review.restaurant_id = @restaurant.id
		@review.user_id = current_user.id

		if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "restaurant_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Great fries with extra smiles!"], ["created_at", "2018-11-29 01:56:47.405620"], ["updated_at", "2018-11-29 01:56:47.405620"], ["user_id", 3], ["restaurant_id", 9]]

	def update
		@review = Review.find(params[:id])

		if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "Pretty meh You've been jacked"], ["updated_at", "2018-12-01 16:38:21.488092"], ["id", 4]]

		def find_restaurant
			@restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]