GameReview/app/controllers/games_controller.rb

	def index
		if params[:search]
			@games = Game.search(params[:search]).order("created_at DESC")
---
SELECT "games".* FROM "games" WHERE (title like '%#{search}' OR genre like '%#{search}' OR developer like '%#{search}') ORDER BY created_at DESC

	def create
		@game = current_user.games.build(game_params)

		if @game.save
---
INSERT INTO "games" ("title", "description", "developer", "genre", "created_at", "updated_at", "user_id", "game_img_file_name", "game_img_content_type", "game_img_file_size", "game_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def show
		if @game.reviews.blank?
			@average_review = 0
		else
			@average_review = @game.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 7]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."game_id" = ?  [["game_id", 7]]

	def update
		if @game.update(game_params)
---
UPDATE "games" SET "description" = ?, "developer" = ?, "game_img_file_name" = ?, "game_img_file_size" = ?, "game_img_updated_at" = ?, "updated_at" = ? WHERE "games"."id" = ?

		def find_game
			@game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]