GameReview/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "game_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "This was a great game"], ["created_at", "2018-11-30 05:13:18.812692"], ["updated_at", "2018-11-30 05:13:18.812692"], ["user_id", 1], ["game_id", 7]]
---
	def create
		@review = Review.new(review_params)
		@review.game_id = @game.id
		@review.user_id = current_user.id

		if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def update
		@review = Review.find(params[:id])

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
		def find_game
			@game = Game.find(params[:game_id])